zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/uart_reg.h
#define UART_LINE_NSB_Pos               (2)                                               /*!< UART_T::LINE: NSB Position            */
#define UART_LINE_NSB_Msk               (0x1ul << UART_LINE_NSB_Pos)                      /*!< UART_T::LINE: NSB Mask                */

#define UART_LINE_PBE_Pos               (3)                                               /*!< UART_T::LINE: PBE Position            */
#define UART_LINE_PBE_Msk               (0x1ul << UART_LINE_PBE_Pos)                      /*!< UART_T::LINE: PBE Mask                */

#define UART_LINE_EPE_Pos               (4)                                               /*!< UART_T::LINE: EPE Position            */
#define UART_LINE_EPE_Msk               (0x1ul << UART_LINE_EPE_Pos)                      /*!< UART_T::LINE: EPE Mask                */

#define UART_LINE_SPE_Pos               (5)                                               /*!< UART_T::LINE: SPE Position            */
#define UART_LINE_SPE_Msk               (0x1ul << UART_LINE_SPE_Pos)                      /*!< UART_T::LINE: SPE Mask                */

#define UART_LINE_BCB_Pos               (6)                                               /*!< UART_T::LINE: BCB Position            */
#define UART_LINE_BCB_Msk               (0x1ul << UART_LINE_BCB_Pos)                      /*!< UART_T::LINE: BCB Mask                */

#define UART_LINE_PSS_Pos               (7)                                               /*!< UART_T::LINE: PSS Position            */
#define UART_LINE_PSS_Msk               (0x1ul << UART_LINE_PSS_Pos)                      /*!< UART_T::LINE: PSS Mask                */

#define UART_LINE_TXDINV_Pos            (8)                                               /*!< UART_T::LINE: TXDINV Position         */
#define UART_LINE_TXDINV_Msk            (0x1ul << UART_LINE_TXDINV_Pos)                   /*!< UART_T::LINE: TXDINV Mask             */

#define UART_LINE_RXDINV_Pos            (9)                                               /*!< UART_T::LINE: RXDINV Position         */
#define UART_LINE_RXDINV_Msk            (0x1ul << UART_LINE_RXDINV_Pos)                   /*!< UART_T::LINE: RXDINV Mask             */

#define UART_MODEM_RTS_Pos              (1)                                               /*!< UART_T::MODEM: RTS Position           */
#define UART_MODEM_RTS_Msk              (0x1ul << UART_MODEM_RTS_Pos)                     /*!< UART_T::MODEM: RTS Mask               */

#define UART_MODEM_RTSACTLV_Pos         (9)                                               /*!< UART_T::MODEM: RTSACTLV Position      */
#define UART_MODEM_RTSACTLV_Msk         (0x1ul << UART_MODEM_RTSACTLV_Pos)                /*!< UART_T::MODEM: RTSACTLV Mask          */

#define UART_MODEM_RTSSTS_Pos           (13)                                              /*!< UART_T::MODEM: RTSSTS Position        */
#define UART_MODEM_RTSSTS_Msk           (0x1ul << UART_MODEM_RTSSTS_Pos)                  /*!< UART_T::MODEM: RTSSTS Mask            */

#define UART_MODEMSTS_CTSDETF_Pos       (0)                                               /*!< UART_T::MODEMSTS: CTSDETF Position    */
#define UART_MODEMSTS_CTSDETF_Msk       (0x1ul << UART_MODEMSTS_CTSDETF_Pos)              /*!< UART_T::MODEMSTS: CTSDETF Mask        */

#define UART_MODEMSTS_CTSSTS_Pos        (4)                                               /*!< UART_T::MODEMSTS: CTSSTS Position     */
#define UART_MODEMSTS_CTSSTS_Msk        (0x1ul << UART_MODEMSTS_CTSSTS_Pos)               /*!< UART_T::MODEMSTS: CTSSTS Mask         */

#define UART_MODEMSTS_CTSACTLV_Pos      (8)                                               /*!< UART_T::MODEMSTS: CTSACTLV Position   */
#define UART_MODEMSTS_CTSACTLV_Msk      (0x1ul << UART_MODEMSTS_CTSACTLV_Pos)             /*!< UART_T::MODEMSTS: CTSACTLV Mask       */

#define UART_FIFOSTS_RXOVIF_Pos         (0)                                               /*!< UART_T::FIFOSTS: RXOVIF Position      */
#define UART_FIFOSTS_RXOVIF_Msk         (0x1ul << UART_FIFOSTS_RXOVIF_Pos)                /*!< UART_T::FIFOSTS: RXOVIF Mask          */

#define UART_FIFOSTS_ABRDIF_Pos         (1)                                               /*!< UART_T::FIFOSTS: ABRDIF Position      */
#define UART_FIFOSTS_ABRDIF_Msk         (0x1ul << UART_FIFOSTS_ABRDIF_Pos)                /*!< UART_T::FIFOSTS: ABRDIF Mask          */

#define UART_FIFOSTS_ABRDTOIF_Pos       (2)                                               /*!< UART_T::FIFOSTS: ABRDTOIF Position    */
#define UART_FIFOSTS_ABRDTOIF_Msk       (0x1ul << UART_FIFOSTS_ABRDTOIF_Pos)              /*!< UART_T::FIFOSTS: ABRDTOIF Mask        */

#define UART_FIFOSTS_ADDRDETF_Pos       (3)                                               /*!< UART_T::FIFOSTS: ADDRDETF Position    */
#define UART_FIFOSTS_ADDRDETF_Msk       (0x1ul << UART_FIFOSTS_ADDRDETF_Pos)              /*!< UART_T::FIFOSTS: ADDRDETF Mask        */

#define UART_FIFOSTS_PEF_Pos            (4)                                               /*!< UART_T::FIFOSTS: PEF Position         */
#define UART_FIFOSTS_PEF_Msk            (0x1ul << UART_FIFOSTS_PEF_Pos)                   /*!< UART_T::FIFOSTS: PEF Mask             */

#define UART_FIFOSTS_FEF_Pos            (5)                                               /*!< UART_T::FIFOSTS: FEF Position         */
#define UART_FIFOSTS_FEF_Msk            (0x1ul << UART_FIFOSTS_FEF_Pos)                   /*!< UART_T::FIFOSTS: FEF Mask             */

#define UART_FIFOSTS_BIF_Pos            (6)                                               /*!< UART_T::FIFOSTS: BIF Position         */
#define UART_FIFOSTS_BIF_Msk            (0x1ul << UART_FIFOSTS_BIF_Pos)                   /*!< UART_T::FIFOSTS: BIF Mask             */

#define UART_FIFOSTS_RXPTR_Pos          (8)                                               /*!< UART_T::FIFOSTS: RXPTR Position       */
#define UART_FIFOSTS_RXPTR_Msk          (0x3ful << UART_FIFOSTS_RXPTR_Pos)                /*!< UART_T::FIFOSTS: RXPTR Mask           */

#define UART_FIFOSTS_RXEMPTY_Pos        (14)                                              /*!< UART_T::FIFOSTS: RXEMPTY Position     */
#define UART_FIFOSTS_RXEMPTY_Msk        (0x1ul << UART_FIFOSTS_RXEMPTY_Pos)               /*!< UART_T::FIFOSTS: RXEMPTY Mask         */

#define UART_FIFOSTS_RXFULL_Pos         (15)                                              /*!< UART_T::FIFOSTS: RXFULL Position      */
#define UART_FIFOSTS_RXFULL_Msk         (0x1ul << UART_FIFOSTS_RXFULL_Pos)                /*!< UART_T::FIFOSTS: RXFULL Mask          */

