zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/uart_reg.h
#define UART_FIFOSTS_TXPTR_Pos          (16)                                              /*!< UART_T::FIFOSTS: TXPTR Position       */
#define UART_FIFOSTS_TXPTR_Msk          (0x3ful << UART_FIFOSTS_TXPTR_Pos)                /*!< UART_T::FIFOSTS: TXPTR Mask           */

#define UART_FIFOSTS_TXEMPTY_Pos        (22)                                              /*!< UART_T::FIFOSTS: TXEMPTY Position     */
#define UART_FIFOSTS_TXEMPTY_Msk        (0x1ul << UART_FIFOSTS_TXEMPTY_Pos)               /*!< UART_T::FIFOSTS: TXEMPTY Mask         */

#define UART_FIFOSTS_TXFULL_Pos         (23)                                              /*!< UART_T::FIFOSTS: TXFULL Position      */
#define UART_FIFOSTS_TXFULL_Msk         (0x1ul << UART_FIFOSTS_TXFULL_Pos)                /*!< UART_T::FIFOSTS: TXFULL Mask          */

#define UART_FIFOSTS_TXOVIF_Pos         (24)                                              /*!< UART_T::FIFOSTS: TXOVIF Position      */
#define UART_FIFOSTS_TXOVIF_Msk         (0x1ul << UART_FIFOSTS_TXOVIF_Pos)                /*!< UART_T::FIFOSTS: TXOVIF Mask          */

#define UART_FIFOSTS_TXEMPTYF_Pos       (28)                                              /*!< UART_T::FIFOSTS: TXEMPTYF Position    */
#define UART_FIFOSTS_TXEMPTYF_Msk       (0x1ul << UART_FIFOSTS_TXEMPTYF_Pos)              /*!< UART_T::FIFOSTS: TXEMPTYF Mask        */

#define UART_FIFOSTS_RXIDLE_Pos         (29)                                              /*!< UART_T::FIFOSTS: RXIDLE Position      */
#define UART_FIFOSTS_RXIDLE_Msk         (0x1ul << UART_FIFOSTS_RXIDLE_Pos)                /*!< UART_T::FIFOSTS: RXIDLE Mask          */

#define UART_FIFOSTS_TXRXACT_Pos        (31)                                              /*!< UART_T::FIFOSTS: TXRXACT Position     */
#define UART_FIFOSTS_TXRXACT_Msk        (0x1ul << UART_FIFOSTS_TXRXACT_Pos)               /*!< UART_T::FIFOSTS: TXRXACT Mask         */

#define UART_INTSTS_RDAIF_Pos           (0)                                               /*!< UART_T::INTSTS: RDAIF Position        */
#define UART_INTSTS_RDAIF_Msk           (0x1ul << UART_INTSTS_RDAIF_Pos)                  /*!< UART_T::INTSTS: RDAIF Mask            */

#define UART_INTSTS_THREIF_Pos          (1)                                               /*!< UART_T::INTSTS: THREIF Position       */
#define UART_INTSTS_THREIF_Msk          (0x1ul << UART_INTSTS_THREIF_Pos)                 /*!< UART_T::INTSTS: THREIF Mask           */

#define UART_INTSTS_RLSIF_Pos           (2)                                               /*!< UART_T::INTSTS: RLSIF Position        */
#define UART_INTSTS_RLSIF_Msk           (0x1ul << UART_INTSTS_RLSIF_Pos)                  /*!< UART_T::INTSTS: RLSIF Mask            */

#define UART_INTSTS_MODEMIF_Pos         (3)                                               /*!< UART_T::INTSTS: MODEMIF Position      */
#define UART_INTSTS_MODEMIF_Msk         (0x1ul << UART_INTSTS_MODEMIF_Pos)                /*!< UART_T::INTSTS: MODEMIF Mask          */

#define UART_INTSTS_RXTOIF_Pos          (4)                                               /*!< UART_T::INTSTS: RXTOIF Position       */
#define UART_INTSTS_RXTOIF_Msk          (0x1ul << UART_INTSTS_RXTOIF_Pos)                 /*!< UART_T::INTSTS: RXTOIF Mask           */

#define UART_INTSTS_BUFERRIF_Pos        (5)                                               /*!< UART_T::INTSTS: BUFERRIF Position     */
#define UART_INTSTS_BUFERRIF_Msk        (0x1ul << UART_INTSTS_BUFERRIF_Pos)               /*!< UART_T::INTSTS: BUFERRIF Mask         */

#define UART_INTSTS_WKIF_Pos            (6)                                               /*!< UART_T::INTSTS: WKIF Position         */
#define UART_INTSTS_WKIF_Msk            (0x1ul << UART_INTSTS_WKIF_Pos)                   /*!< UART_T::INTSTS: WKIF Mask             */

#define UART_INTSTS_LINIF_Pos           (7)                                               /*!< UART_T::INTSTS: LINIF Position        */
#define UART_INTSTS_LINIF_Msk           (0x1ul << UART_INTSTS_LINIF_Pos)                  /*!< UART_T::INTSTS: LINIF Mask            */

#define UART_INTSTS_RDAINT_Pos          (8)                                               /*!< UART_T::INTSTS: RDAINT Position       */
#define UART_INTSTS_RDAINT_Msk          (0x1ul << UART_INTSTS_RDAINT_Pos)                 /*!< UART_T::INTSTS: RDAINT Mask           */

#define UART_INTSTS_THREINT_Pos         (9)                                               /*!< UART_T::INTSTS: THREINT Position      */
#define UART_INTSTS_THREINT_Msk         (0x1ul << UART_INTSTS_THREINT_Pos)                /*!< UART_T::INTSTS: THREINT Mask          */

#define UART_INTSTS_RLSINT_Pos          (10)                                              /*!< UART_T::INTSTS: RLSINT Position       */
#define UART_INTSTS_RLSINT_Msk          (0x1ul << UART_INTSTS_RLSINT_Pos)                 /*!< UART_T::INTSTS: RLSINT Mask           */

#define UART_INTSTS_MODEMINT_Pos        (11)                                              /*!< UART_T::INTSTS: MODEMINT Position     */
#define UART_INTSTS_MODEMINT_Msk        (0x1ul << UART_INTSTS_MODEMINT_Pos)               /*!< UART_T::INTSTS: MODEMINT Mask         */

#define UART_INTSTS_RXTOINT_Pos         (12)                                              /*!< UART_T::INTSTS: RXTOINT Position      */
#define UART_INTSTS_RXTOINT_Msk         (0x1ul << UART_INTSTS_RXTOINT_Pos)                /*!< UART_T::INTSTS: RXTOINT Mask          */

#define UART_INTSTS_BUFERRINT_Pos       (13)                                              /*!< UART_T::INTSTS: BUFERRINT Position    */
#define UART_INTSTS_BUFERRINT_Msk       (0x1ul << UART_INTSTS_BUFERRINT_Pos)              /*!< UART_T::INTSTS: BUFERRINT Mask        */

#define UART_INTSTS_WKINT_Pos           (14)                                              /*!< UART_T::INTSTS: WKINT Position        */
#define UART_INTSTS_WKINT_Msk           (0x1ul << UART_INTSTS_WKINT_Pos)                  /*!< UART_T::INTSTS: WKINT Mask            */

#define UART_INTSTS_LININT_Pos          (15)                                              /*!< UART_T::INTSTS: LININT Position       */
#define UART_INTSTS_LININT_Msk          (0x1ul << UART_INTSTS_LININT_Pos)                 /*!< UART_T::INTSTS: LININT Mask           */

#define UART_INTSTS_SWBEIF_Pos          (16)                                              /*!< UART_T::INTSTS: SWBEIF Position       */
#define UART_INTSTS_SWBEIF_Msk          (0x1ul << UART_INTSTS_SWBEIF_Pos)                 /*!< UART_T::INTSTS: SWBEIF Mask           */

#define UART_INTSTS_HWRLSIF_Pos         (18)                                              /*!< UART_T::INTSTS: HWRLSIF Position      */
#define UART_INTSTS_HWRLSIF_Msk         (0x1ul << UART_INTSTS_HWRLSIF_Pos)                /*!< UART_T::INTSTS: HWRLSIF Mask          */

#define UART_INTSTS_HWMODIF_Pos         (19)                                              /*!< UART_T::INTSTS: HWMODIF Position      */
#define UART_INTSTS_HWMODIF_Msk         (0x1ul << UART_INTSTS_HWMODIF_Pos)                /*!< UART_T::INTSTS: HWMODIF Mask          */

#define UART_INTSTS_HWTOIF_Pos          (20)                                              /*!< UART_T::INTSTS: HWTOIF Position       */
#define UART_INTSTS_HWTOIF_Msk          (0x1ul << UART_INTSTS_HWTOIF_Pos)                 /*!< UART_T::INTSTS: HWTOIF Mask           */

#define UART_INTSTS_HWBUFEIF_Pos        (21)                                              /*!< UART_T::INTSTS: HWBUFEIF Position     */
#define UART_INTSTS_HWBUFEIF_Msk        (0x1ul << UART_INTSTS_HWBUFEIF_Pos)               /*!< UART_T::INTSTS: HWBUFEIF Mask         */

#define UART_INTSTS_TXENDIF_Pos         (22)                                              /*!< UART_T::INTSTS: TXENDIF Position      */
#define UART_INTSTS_TXENDIF_Msk         (0x1ul << UART_INTSTS_TXENDIF_Pos)                /*!< UART_T::INTSTS: TXENDIF Mask          */

