zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/uart_reg.h
#define UART_INTSTS_SWBEINT_Pos         (24)                                              /*!< UART_T::INTSTS: SWBEINT Position      */
#define UART_INTSTS_SWBEINT_Msk         (0x1ul << UART_INTSTS_SWBEINT_Pos)                /*!< UART_T::INTSTS: SWBEINT Mask          */

#define UART_INTSTS_HWRLSINT_Pos        (26)                                              /*!< UART_T::INTSTS: HWRLSINT Position     */
#define UART_INTSTS_HWRLSINT_Msk        (0x1ul << UART_INTSTS_HWRLSINT_Pos)               /*!< UART_T::INTSTS: HWRLSINT Mask         */

#define UART_INTSTS_HWMODINT_Pos        (27)                                              /*!< UART_T::INTSTS: HWMODINT Position     */
#define UART_INTSTS_HWMODINT_Msk        (0x1ul << UART_INTSTS_HWMODINT_Pos)               /*!< UART_T::INTSTS: HWMODINT Mask         */

#define UART_INTSTS_HWTOINT_Pos         (28)                                              /*!< UART_T::INTSTS: HWTOINT Position      */
#define UART_INTSTS_HWTOINT_Msk         (0x1ul << UART_INTSTS_HWTOINT_Pos)                /*!< UART_T::INTSTS: HWTOINT Mask          */

#define UART_INTSTS_HWBUFEINT_Pos       (29)                                              /*!< UART_T::INTSTS: HWBUFEINT Position    */
#define UART_INTSTS_HWBUFEINT_Msk       (0x1ul << UART_INTSTS_HWBUFEINT_Pos)              /*!< UART_T::INTSTS: HWBUFEINT Mask        */

#define UART_INTSTS_TXENDINT_Pos        (30)                                              /*!< UART_T::INTSTS: TXENDINT Position     */
#define UART_INTSTS_TXENDINT_Msk        (0x1ul << UART_INTSTS_TXENDINT_Pos)               /*!< UART_T::INTSTS: TXENDINT Mask         */

#define UART_INTSTS_ABRINT_Pos          (31)                                              /*!< UART_T::INTSTS: ABRINT Position       */
#define UART_INTSTS_ABRINT_Msk          (0x1ul << UART_INTSTS_ABRINT_Pos)                 /*!< UART_T::INTSTS: ABRINT Mask           */

#define UART_TOUT_TOIC_Pos              (0)                                               /*!< UART_T::TOUT: TOIC Position           */
#define UART_TOUT_TOIC_Msk              (0xfful << UART_TOUT_TOIC_Pos)                    /*!< UART_T::TOUT: TOIC Mask               */

#define UART_TOUT_DLY_Pos               (8)                                               /*!< UART_T::TOUT: DLY Position            */
#define UART_TOUT_DLY_Msk               (0xfful << UART_TOUT_DLY_Pos)                     /*!< UART_T::TOUT: DLY Mask                */

#define UART_TOUT_BITOMEN_Pos           (31)                                              /*!< UART_T::TOUT: BITOMEN Position        */
#define UART_TOUT_BITOMEN_Msk           (0x1ul << UART_TOUT_BITOMEN_Pos)                  /*!< UART_T::TOUT: BITOMEN Mask            */

#define UART_BAUD_BRD_Pos               (0)                                               /*!< UART_T::BAUD: BRD Position            */
#define UART_BAUD_BRD_Msk               (0xfffful << UART_BAUD_BRD_Pos)                   /*!< UART_T::BAUD: BRD Mask                */

#define UART_BAUD_BRFD_Pos              (16)                                              /*!< UART_T::BAUD: BRFD Position           */
#define UART_BAUD_BRFD_Msk              (0xfful << UART_BAUD_BRFD_Pos)                    /*!< UART_T::BAUD: BRFD Mask               */

#define UART_BAUD_EDIVM1_Pos            (24)                                              /*!< UART_T::BAUD: EDIVM1 Position         */
#define UART_BAUD_EDIVM1_Msk            (0xful << UART_BAUD_EDIVM1_Pos)                   /*!< UART_T::BAUD: EDIVM1 Mask             */

#define UART_BAUD_BAUDM0_Pos            (28)                                              /*!< UART_T::BAUD: BAUDM0 Position         */
#define UART_BAUD_BAUDM0_Msk            (0x1ul << UART_BAUD_BAUDM0_Pos)                   /*!< UART_T::BAUD: BAUDM0 Mask             */

#define UART_BAUD_BAUDM1_Pos            (29)                                              /*!< UART_T::BAUD: BAUDM1 Position         */
#define UART_BAUD_BAUDM1_Msk            (0x1ul << UART_BAUD_BAUDM1_Pos)                   /*!< UART_T::BAUD: BAUDM1 Mask             */

#define UART_BAUD_BRFDEN_Pos            (30)                                              /*!< UART_T::BAUD: BRFDEN Position         */
#define UART_BAUD_BRFDEN_Msk            (0x1ul << UART_BAUD_BRFDEN_Pos)                   /*!< UART_T::BAUD: BRFDEN Mask             */

#define UART_IRDA_TXEN_Pos              (1)                                               /*!< UART_T::IRDA: TXEN Position           */
#define UART_IRDA_TXEN_Msk              (0x1ul << UART_IRDA_TXEN_Pos)                     /*!< UART_T::IRDA: TXEN Mask               */

#define UART_IRDA_TXINV_Pos             (5)                                               /*!< UART_T::IRDA: TXINV Position          */
#define UART_IRDA_TXINV_Msk             (0x1ul << UART_IRDA_TXINV_Pos)                    /*!< UART_T::IRDA: TXINV Mask              */

#define UART_IRDA_RXINV_Pos             (6)                                               /*!< UART_T::IRDA: RXINV Position          */
#define UART_IRDA_RXINV_Msk             (0x1ul << UART_IRDA_RXINV_Pos)                    /*!< UART_T::IRDA: RXINV Mask              */

#define UART_ALTCTL_BRKFL_Pos           (0)                                               /*!< UART_T::ALTCTL: BRKFL Position        */
#define UART_ALTCTL_BRKFL_Msk           (0xful << UART_ALTCTL_BRKFL_Pos)                  /*!< UART_T::ALTCTL: BRKFL Mask            */

#define UART_ALTCTL_LINRXEN_Pos         (6)                                               /*!< UART_T::ALTCTL: LINRXEN Position      */
#define UART_ALTCTL_LINRXEN_Msk         (0x1ul << UART_ALTCTL_LINRXEN_Pos)               /*!< UART_T::ALTCTL: LINRXEN Mask          */

#define UART_ALTCTL_LINTXEN_Pos         (7)                                               /*!< UART_T::ALTCTL: LINTXEN Position      */
#define UART_ALTCTL_LINTXEN_Msk         (0x1ul << UART_ALTCTL_LINTXEN_Pos)                /*!< UART_T::ALTCTL: LINTXEN Mask          */

#define UART_ALTCTL_RS485NMM_Pos        (8)                                               /*!< UART_T::ALTCTL: RS485NMM Position     */
#define UART_ALTCTL_RS485NMM_Msk        (0x1ul << UART_ALTCTL_RS485NMM_Pos)               /*!< UART_T::ALTCTL: RS485NMM Mask         */

#define UART_ALTCTL_RS485AAD_Pos        (9)                                               /*!< UART_T::ALTCTL: RS485AAD Position     */
#define UART_ALTCTL_RS485AAD_Msk        (0x1ul << UART_ALTCTL_RS485AAD_Pos)               /*!< UART_T::ALTCTL: RS485AAD Mask         */

